In [1]:
# Import dependencies

import pandas as pd
from sqlalchemy import create_engine

In [2]:
# Create database engine and connection

engine = create_engine('postgresql://postgres:oingoboingo@localhost:5432/09-SQL')
cxt = engine.connect()

In [3]:
# Import employees_df table

employees_df = pd.read_sql("employees",cxt)
employees_df.head()

   emp_no birth_date first_name last_name gender  hire_date
0   10001 1953-09-02     Georgi   Facello      M 1986-06-26
1   10002 1964-06-02    Bezalel    Simmel      F 1985-11-21
2   10003 1959-12-03      Parto   Bamford      M 1986-08-28
3   10004 1954-05-01  Chirstian   Koblick      M 1986-12-01
4   10005 1955-01-21    Kyoichi  Maliniak      M 1989-09-12

In [4]:
# Import salaries_df table

salaries_df = pd.read_sql("salaries",cxt)
salaries_df.head()

   emp_no  salary  from_date    to_date
0   10001   60117 1986-06-26 1987-06-26
1   10002   65828 1996-08-03 1997-08-03
2   10003   40006 1995-12-03 1996-12-02
3   10004   40054 1986-12-01 1987-12-01
4   10005   78228 1989-09-12 1990-09-12

In [5]:
# Import titles_df table

titles_df = pd.read_sql("titles",cxt)
titles_df.head()

   emp_no            title  from_date    to_date
0   10001  Senior Engineer 1986-06-26        NaT
1   10002            Staff 1996-08-03        NaT
2   10003  Senior Engineer 1995-12-03        NaT
3   10004         Engineer 1986-12-01 1995-12-01
4   10004  Senior Engineer 1995-12-01        NaT

In [6]:
# Merge salaries + titles_df tables on employee no

salaries_titles_df = pd.merge(salaries_df, titles_df, on='emp_no')
salaries_titles_df.head()

,emp_no,salary,from_date_x,to_date_x,title,from_date_y,to_date_y
0,10001,60117,1986-06-26,1987-06-26,Senior Engineer,1986-06-26,NaT
1,10002,65828,1996-08-03,1997-08-03,Staff,1996-08-03,NaT
2,10003,40006,1995-12-03,1996-12-02,Senior Engineer,1995-12-03,NaT
3,10004,40054,1986-12-01,1987-12-01,Engineer,1986-12-01,1995-12-01
4,10004,40054,1986-12-01,1987-12-01,Senior Engineer,1995-12-01,NaT

In [7]:
# Merge newly merged table to employees_df table, merge on employee no 

merged_df = pd.merge(employees_df,salaries_titles_df, on='emp_no')
merged_df.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,salary,from_date_x,to_date_x,title,from_date_y,to_date_y
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,60117,1986-06-26,1987-06-26,Senior Engineer,1986-06-26,NaT
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,65828,1996-08-03,1997-08-03,Staff,1996-08-03,NaT
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,40006,1995-12-03,1996-12-02,Senior Engineer,1995-12-03,NaT
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,40054,1986-12-01,1987-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,40054,1986-12-01,1987-12-01,Senior Engineer,1995-12-01,NaT

In [8]:
# Group salaries by title

salary_by_title = merged_df['salary'].groupby([merged_df['title']]).mean()

# Turn grouped data into dataframe

salary_by_title = pd.DataFrame(salary_by_title)

# Format salaries

salary_by_title = (salary_by_title['salary']).apply(lambda x: '${:,.0f}'.format(x))

# Sort salaries by descending value

salary_by_title = salary_by_title.sort_values(ascending=False)

# Dataframe
salary_by_title = pd.DataFrame(salary_by_title)

# Print
salary_by_title

                     salary
title
Senior Staff        $58,503
Staff               $58,465
Manager             $51,531
Technique Leader    $48,581
Engineer            $48,540
Senior Engineer     $48,507
Assistant Engineer  $48,493